src/Catalogs/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеХраненияНомера</Name>
					<Comment>преобразованный для поиска телефонный номер</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Районы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчаствуетВРассылках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/АдресныйКлассификатор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>АдресныйКлассификатор</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>52</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сокращение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АльтернативныеНазвания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипАдресногоЭлемента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРайонаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодГородаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНаселенногоПунктаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУлицыВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодРегионаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/КонтактнаяИнформация/Forms/ФормаЗаписиАдресаРМ/module.bsl
Перем ПараметрыОкна Экспорт;	// структура, определяет положение и размеры окна

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура формирует строковое представление адреса.
Процедура СформироватьПредставление()

	Представление = "";

	Если СокрЛП(Поле1) <> "" Тогда
		Представление = Представление + ", " + СокрЛП(Поле1);
	КонецЕсли;

	Если СокрЛП(Поле2) <> "" Тогда
		Представление = Представление + ", " + СокрЛП(Поле2);
	КонецЕсли;

	Если СокрЛП(Поле3) <> "" Тогда
		Представление = Представление + ", " + СокрЛП(Поле3);
	КонецЕсли;

	Если СокрЛП(Поле4) <> "" Тогда
		Представление = Представление + ", " + СокрЛП(Поле4);
	КонецЕсли;

	Если СокрЛП(Поле5) <> "" Тогда
		Представление = Представление + ", " + СокрЛП(Поле5);
	КонецЕсли;
	
	Если СокрЛП(Район) <> "" Тогда
		Представление = Представление + ", " + СокрЛП(Район);
	КонецЕсли;

	Если СокрЛП(Поле6) <> "" Тогда
		Представление = Представление + ", " + СокрЛП(Поле6);
	КонецЕсли;

	Если СокрЛП(Поле7) <> "" Тогда
		Если НЕ СокрЛП(СЗДом) = "другое" Тогда
			ПредставлениеДом = СЗДом + Поле7;
		Иначе
			ПредставлениеДом = Поле7;
		КонецЕсли;
		Представление = Представление + ", " + СокрЛП(ПредставлениеДом);
	КонецЕсли;

	Если СокрЛП(Поле8) <> "" Тогда
		Если НЕ СокрЛП(КорЛит) = "другое" Тогда
			ПредставлениеКор = КорЛит + Поле8;
		Иначе
			ПредставлениеКор = Поле8;
		КонецЕсли;
		Представление = Представление + ", " + СокрЛП(ПредставлениеКор);
	КонецЕсли;

	Если СокрЛП(Поле9) <> "" Тогда
		Если НЕ СокрЛП(Кв) = "другое" Тогда
			ПредставлениеКв = Кв + Поле9;
		Иначе
			ПредставлениеКв = Поле9;
		КонецЕсли;
		Представление = Представление + ", " + СокрЛП(ПредставлениеКв);
	КонецЕсли;

	Если СтрДлина(Представление) > 2 Тогда
		Представление = Сред(Представление, 3);
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	
	КорЛит	= ПолучитьИзПоля10("КорЛит");
	Кв		= ПолучитьИзПоля10("Кв");
	СЗДом	= ПолучитьИзПоля10("Дом");
	
	// вызов должен быть в конце обработчика
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
	
КонецПроцедуры

Процедура ПриЗакрытии()
	
	ИнтерфейсРМ.ПриЗакрытииОкна();
	
КонецПроцедуры

Процедура ПослеЗаписи()
	
	ОповеститьОЗаписиНовогоОбъекта(Ссылка);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	СформироватьПредставление();
	
	Если Представление="" Тогда
		Предупреждение("Адрес пустой");
		Отказ = Истина;
	КонецЕсли; 
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура УлицаПриИзменении(Элемент)
	
	Если КорЛит = "корпус " Тогда
		Поле1 = киПолучитьИндекс(Поле2, Поле3, Поле4, Поле5, Поле6, Поле7, Поле8);
	Иначе
		Поле1 = киПолучитьИндекс(Поле2, Поле3, Поле4, Поле5, Поле6, Поле7, "");
	КонецЕсли;
	СформироватьПредставление();
	
КонецПроцедуры

Процедура ДомПриИзменении(Элемент)

	Если КорЛит = "корпус " Тогда
		Поле1 = киПолучитьИндекс(Поле2, Поле3, Поле4, Поле5, Поле6, Поле7, Поле8);
	Иначе
		Поле1 = киПолучитьИндекс(Поле2, Поле3, Поле4, Поле5, Поле6, Поле7, "");
	КонецЕсли;
	СформироватьПредставление();

КонецПроцедуры

Процедура КорпусПриИзменении(Элемент)

	Если КорЛит = "корпус " Тогда
		Поле1 = киПолучитьИндекс(Поле2, Поле3, Поле4, Поле5, Поле6, Поле7, Поле8);
	Иначе
		Поле1 = киПолучитьИндекс(Поле2, Поле3, Поле4, Поле5, Поле6, Поле7, "");
	КонецЕсли;
	СформироватьПредставление();

КонецПроцедуры

Процедура КвартираПриИзменении(Элемент)

	СформироватьПредставление();

КонецПроцедуры

Процедура УлицаНачалоВыбора(Элемент, СтандартнаяОбработка)

	ФормаВыбора = РегистрыСведений.АдресныйКлассификатор.ПолучитьФорму("ФормаВыбора", Элемент,);
	ФормаВыбора.НазваниеЭлемента = СокрЛП(Поле6);
	ФормаВыбора.УстановитьРодителя(Поле2, Поле3, Поле4, Поле5);
	ФормаВыбора.ОтобратьТолькоУлицы();
	ФормаВыбора.Открыть();

КонецПроцедуры

Процедура УлицаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	АдреснаяЗапись = киПолучитьСтруктуруАдресногоЭлемента(ВыбранноеЗначение.Код);
	Элемент.Значение = СокрЛП(АдреснаяЗапись.Наименование) + " " + СокрЛП(АдреснаяЗапись.Сокращение);
	АдресЗаполнитьРодителей(Поле2, Поле3, Поле4, Поле5, Поле6, Поле7, Поле1, АдреснаяЗапись);
	СформироватьПредставление();

КонецПроцедуры

Процедура КорЛитПриИзменении(Элемент)
	
	Поле10 = СЗДом + Символы.ПС + КорЛит + Символы.ПС + Кв;
	СформироватьПредставление();
	
КонецПроцедуры

Функция ПолучитьИзПоля10(ЧтоИскать)

	СтрокаДом	= СтрПолучитьСтроку(Поле10, 1);
	СтрокаКор	= СтрПолучитьСтроку(Поле10, 2);
	СтрокаКв	= СтрПолучитьСтроку(Поле10, 3);
	
	Если ЧтоИскать = "КорЛит" Тогда
		Возврат ?(ПустаяСтрока(СтрокаКор), "корпус ", СтрокаКор);
	ИначеЕсли ЧтоИскать = "Кв" Тогда
		Возврат ?(ПустаяСтрока(СтрокаКв), "кв.", СтрокаКв);
	ИначеЕсли ЧтоИскать = "Дом" Тогда
		Возврат ?(ПустаяСтрока(СтрокаДом), "дом № ", СтрокаДом);
	КонецЕсли;
	
КонецФункции

Процедура РайонПриИзменении(Элемент)
	СформироватьПредставление();
КонецПроцедуры

Процедура КнопкаЭкраннаяКлаваНажатие(Элемент)
	
	ИнтерфейсРМ.ЭкраннаяКлавиатура();
	
	ТекущийЭлемент = ЭлементыФормы.Улица;
	
КонецПроцедуры

Процедура КнопкаЗакрытьНажатие(Элемент)
	
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры

Процедура УлицаАвтоПодборТекста(Элемент, Текст, ТекстАвтоПодбора, СтандартнаяОбработка)
	
	АдресАвтоПодборПоКлассификатору(Элемент, Текст, ТекстАвтоПодбора, СтандартнаяОбработка, 5);
	
КонецПроцедуры

Процедура УлицаОкончаниеВводаТекста(Элемент, Текст, Значение, СтандартнаяОбработка)
	
	АдресОкончаниеВводаТекста(Элемент, Текст, Значение, СтандартнаяОбработка, 5)
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ТЕЛО МОДУЛЯ

ПараметрыОкна = Новый Структура("Центр, Лево, Верх, Ширина, Высота", Истина);

СписокВозможныхЗначенийКорЛит = ЭлементыФормы.КорЛит.СписокВыбора;
СписокВозможныхЗначенийКорЛит.Добавить("корпус ", "Корпус");
СписокВозможныхЗначенийКорЛит.Добавить("лит. ", "Литера");
СписокВозможныхЗначенийКорЛит.Добавить("другое ", "другое");

СписокВозможныхЗначенийКв = ЭлементыФормы.Кв.СписокВыбора;
СписокВозможныхЗначенийКв.Добавить("кв.", "Квартира");
СписокВозможныхЗначенийКв.Добавить("пом.", "Помещение");
СписокВозможныхЗначенийКв.Добавить("оф.", "Офис");
СписокВозможныхЗначенийКв.Добавить("другое ", "другое");

СписокВозможныхЗначенийДом = ЭлементыФормы.СЗДом.СписокВыбора;
СписокВозможныхЗначенийДом.Добавить("дом № ", "Дом");
СписокВозможныхЗначенийДом.Добавить("другое", "другое");
